[KnightsCharge X2AbilityTemplate]
LocFriendlyName="Knight's Charge"
LocHelpText="An upgraded Shield Bash that costs 1 action and does not end the turn. Can be used with dashes. Disorrients."
LocLongDescription="An upgraded Shield Bash that costs 1 action and does not end the turn. Can be used with dashes. Disorrients."
LocPromotionPopupText="<Bullet/> An upgraded Shield Bash that costs 1 action and does not end the turn. Can be used with dashes. Disorrients."
LocFlyOverText="Knights Charge"

[KnightsForce X2AbilityTemplate]
LocFriendlyName="Knight's Force"
LocHelpText="A turn ending dashing attack with the shield that stuns for 2 actions."
LocLongDescription="A turn ending dashing attack with the shield that stuns for 2 actions."
LocPromotionPopupText="<Bullet/> A turn ending dashing attack with the shield that stuns for 2 actions. 3 Turn Cooldown."
LocFlyOverText="Knights Force"

[EagleEye X2AbilityTemplate]
LocFriendlyName="Eagle Eye"
LocHelpText="Passively increases sight radius by 5. Activate on cooldown to increase this radius by an additional 5."
LocLongDescription="Passively increases sight radius by 5. Activate on cooldown to increase this radius by an additional 5."
LocPromotionPopupText="<Bullet/> Passively increases sight radius by 5. Activate on cooldown to increase this radius by an additional 5."
LocFlyOverText="Eagle Eye"

[SnapShooting X2AbilityTemplate]
LocFriendlyName="Snap Shooting"
LocHelpText="Grants The Snap Shot, Snap Shot Overwatch, and Weapons Master abilities."
LocLongDescription="Grants The Snap Shot, Snap Shot Overwatch, and Weapons Master abilities."
LocPromotionPopupText="<Bullet/> Grants The Snap Shot, Snap Shot Overwatch, and Weapons Master abilities. \n<Bullet/> Allows you to move and shoot, or move and overwatch with your sniper rifle, and negates the short range penalty of sniper rifles."

[WeaponsMaster X2AbilityTemplate]
LocFriendlyName="Weapons Master"
LocHelpText="Negates the close range penalty of sniper rifles."
LocLongDescription="Negates the close range penalty of sniper rifles."
LocPromotionPopupText="<Bullet/> Negates the close range penalty of sniper rifles."

[GenevaFix X2AbilityTemplate]
LocFriendlyName="Geneva Fix"
LocHelpText="This fixes the issue that all of the mitzruti free grenade perks were reducing mobility."
LocLongDescription="This fixes the issue that all of the mitzruti free grenade perks were reducing mobility."
LocPromotionPopupText="<Bullet/> This fixes the issue that all of the mitzruti free grenade perks were reducing mobility. \n<Bullet/> This is done by making a perk that grants 1 Mobility when each of the mitzruti free grenade perks are taken. Aka a very janky way to fix it."

[ConcealingShot X2AbilityTemplate]
LocFriendlyName="Concealing Shot"
LocHelpText="A special pistol shot that will put you in concealment on kill."
LocLongDescription="A special pistol shot that will put you in concealment on kill."
LocPromotionPopupText="<Bullet/> A special pistol shot that will put you in concealment on kill. \n<Bullet/> 4 Turn Cooldown. \n<Bullet/> If you are already concealed, you will remain concealed if you kill the target."

[SilencedShot X2AbilityTemplate]
LocFriendlyName="Silenced Shot"
LocHelpText="An upgraded Concealing Shot that is non-turn ending, has no cooldown and will put you in concealment on kill."
LocLongDescription="An upgraded Concealing Shot that is non-turn ending, has no cooldown and will put you in concealment on kill.
LocPromotionPopupText="<Bullet/> An upgraded Concealing Shot that is non-turn ending, has no cooldown and will put you in concealment on kill. \n<Bullet/> If you are already concealed, you will remain concealed if you kill the target."

[HighNoon X2AbilityTemplate]
LocFriendlyName="High Noon"
LocHelpText="Negates the long range penalty of pistols."
LocLongDescription="Negates the long range penalty of pistols."
LocPromotionPopupText="<Bullet/> Negates the long range penalty of pistols."

[CrusaderStrike X2AbilityTemplate]
LocFriendlyName="Crusader Strike"
LocHelpText="A sword attack at adjacent enemies."
LocLongDescription="A sword attack at adjacent enemies."
LocPromotionPopupText="<Bullet/> A sword attack at adjacent enemies."
LocFlyOverText="Crusader Strike"

[QuickAid X2AbilityTemplate]
LocFriendlyName="Quick Aid"
LocHelpText="The first time you use various support gremlin abilities in a turn you will refund one action point."
LocLongDescription="The first time you use various support gremlin abilities in a turn you will refund one action point."
LocPromotionPopupText="<Bullet/> Works with Aid Protocol, Shield Protocol, Medical Protocol, Rescue Protocol, Stealth Protocol, Stronghold Protocol, Phalanx Protocol, Revival Protocol, Scouting Protocol, Airdrop, Restorative Mist, and Combat Scanner."
LocFlyOverText="Quick Aid"

[ByMyCommand X2AbilityTemplate]
LocFriendlyName="By My Command"
LocHelpText="The first time you use an officer ability or cover me per turn you will refund the action point used."
LocLongDescription="The first time you use an officer ability or cover me per turn you will refund the action point used."
LocPromotionPopupText="<Bullet/> The first time you use an officer ability or cover me per turn you will refund the action point used."
LocFlyOverText="By My Command

[FlashyPlays X2AbilityTemplate]
LocFriendlyName="Flashy Plays"
LocHelpText="Flashbangs are no longer turn ending. +1 charge for each equipped flashbang."
LocLongDescription="Flashbangs are no longer turn ending. +1 charge for each equipped flashbang."
LocPromotionPopupText="<Bullet/> Flashbangs are no longer turn ending. +1 charge for each equipped flashbang."

[ScanningTechnology X2AbilityTemplate]
LocFriendlyName="Scanning Technology"
LocHelpText="Grants the Combat Scanner, and Improved Scanner Abilities."
LocLongDescription="Grants the Combat Scanner, and Improved Scanner Abilities."
LocPromotionPopupText="<Bullet/> Combat Scanner allows you to scan an area which holotargets and reveals enemies. Improved scanner makes it so scanned enemies are easier to crit."

[WatchdogsProtection X2AbilityTemplate]
LocFriendlyName="Watchdogs Protection"
LocHelpText="Grants the Armour System and Healing Aid Abilities"
LocLongDescription="Grants the Armour System and Healing Aid Abilities"
LocPromotionPopupText="<Bullet/> Armour System causes aid protocol to repair armour as well as grant 1 armour while aid protocol is active. \n<Bullet/> Healing Aid causes your Aid Protocol to heal based on your hack score as well as cleanse effects as if you were applying a medikit"
LocFlyOverText="Watchdogs Protection"

[OppressiveFire X2AbilityTemplate]
LocFriendlyName="Oppressive Fire"
LocHelpText="Grants Focus and Opportunist enhancing overwatch shots"
LocLongDescription="Grants Focus and Opportunist enhancing overwatch shots"
LocPromotionPopupText="<Bullet/> Focus causes your first overwatch shot to be guaranteed to hit. \n<Bullet/> Opportunist causes your other overwatch shots to ignore half of cover bonuses."
LocFlyOverText="Oppressive Fire"

[MaraudersRage X2AbilityTemplate]
LocFriendlyName="Marauders Rage"
LocHelpText="The Marauders Rage allows them to thrive in the midst of combat gaining the Brawler, Infighter, and Steadfast Abilities."
LocLongDescription="The Marauders Rage allows them to thrive in the midst of combat gaining the Brawler, Infighter, and Steadfast Abilities."
LocPromotionPopupText="<Bullet/> The Marauders Rage allows them to thrive in the midst of combat gaining the Brawler, Infighter, and Steadfast Abilities."

[OppressiveFireMalus X2AbilityTemplate]
LocFriendlyName="Oppressive Fire"
LocHelpText="An enhanced covering fire that applies an even stronger aim malus"
LocLongDescription="An enhanced covering fire that applies an even stronger aim malus"
LocPromotionPopupText="<Bullet/> An enhanced covering fire that applies an even stronger aim malus and ignores cover bonuses."
LocFlyOverText="Oppressive Fire"

[ExtendedRange X2AbilityTemplate]
LocFriendlyName="Extended Range"
LocHelpText="Grants the Javelin Rocket, and Incinerator Perks."
LocLongDescription="Grants the Javelin Rocket, and Incinerator Perks. Javelin Rockets increases the range you can launch rockets by 6 tiles. Incinerator increases the range you can use the flamethrower by 1 tile."
LocPromotionPopupText="<Bullet/> Grants the Javelin Rocket, and Incinerator Perks."

[CullTheWeak X2AbilityTemplate]
LocFriendlyName="Cull The Weak"
LocHelpText="Puts you on overwatch after using roust, flamethrower, throwing a grenade, or using the gauntlets rocket launcher."
LocLongDescription="Puts you on overwatch after using roust, flamethrower, throwing a grenade, or using the gauntlets rocket launcher."
LocPromotionPopupText="<Bullet/> Puts you on overwatch after using roust, flamethrower, throwing a grenade, or using the gauntlets rocket launcher."

[SwiftThrow X2AbilityTemplate]
LocFriendlyName="Swift Throw"
LocHelpText="Lightning hands but with knife"
LocLongDescription="Lightning hands but with knife"
LocPromotionPopupText="<Bullet/> Lightning hands but with knife"

[HastenedResolve X2AbilityTemplate]
LocFriendlyName="Hastened Resolve"
LocHelpText="Using One For all will grant a non-movement action."
LocLongDescription="Using One For all will grant a non-movement action."
LocPromotionPopupText="<Bullet/> Using One For all will grant a non-movement action."
LocFlyOverText="Hastened Resolve"

[BulletArtist X2AbilityTemplate]
LocFriendlyName="Bullet Artist"
LocHelpText="This soldier has trained and enhanced their usage of bullet arts, granting 2 more charges of their bullet art and causing it to deal more damage."
LocLongDescription="This soldier has trained and enhanced their usage of bullet arts, granting 2 more charges of their bullet art and causing it to deal more damage."
LocPromotionPopupText="<Bullet/> This soldier has trained and enhanced their usage of bullet arts, granting 2 more charges of their bullet art and causing it to deal more damage."

[BlackBulletArtist X2AbilityTemplate]
LocFriendlyName="Black Bullet Artist"
LocHelpText="Further upgrades black bullet to deal more damage over time with blood curse and to stun enemies hit."
LocLongDescription="Further upgrades black bullet to deal more damage over time with blood curse and to stun enemies hit."
LocPromotionPopupText="<Bullet/> Further upgrades black bullet to deal more damage over time with blood curse and to stun enemies hit."

[FrostBulletArtist X2AbilityTemplate]
LocFriendlyName="Frost Bullet Artist"
LocHelpText="Further upgrades frost bullet to strike twice for 60% damage each hit, and apply hypothermia which deals damage over time based on chill level."
LocLongDescription="Further upgrades frost bullet to strike twice for 60% damage each hit, and apply hypothermia which deals damage over time based on chill level."
LocPromotionPopupText="<Bullet/> Further upgrades frost bullet to strike twice for 60% damage each hit, and apply hypothermia which deals damage over time based on chill level."

[BlazeBulletArtist X2AbilityTemplate]
LocFriendlyName="Blaze Bullet Artist"
LocHelpText="Further upgrades blaze bullet to massively enhance the damage over time of the burn."
LocLongDescription="Further upgrades blaze bullet to massively enhance the damage over time of the burn."
LocPromotionPopupText="<Bullet/> Further upgrades blaze bullet to massively enhance the damage over time of the burn."

[ToxicBulletArtist X2AbilityTemplate]
LocFriendlyName="Toxic Bullet Artist"
LocHelpText="Further upgrades toxic bullet to enhance the damage over time of their poison and it now applies disorient."
LocLongDescription="Further upgrades toxic bullet to enhance the damage over time of their poison and it now applies disorient."
LocPromotionPopupText="<Bullet/> Further upgrades toxic bullet to enhance the damage over time of their poison and it now applies disorient."

[AcidBulletArtist X2AbilityTemplate]
LocFriendlyName="Acid Bullet Artist"
LocHelpText="Further upgrades acid bullet to enhance the damage over time of their acid and it now reduces the damage the enemie deals."
LocLongDescription="Further upgrades acid bullet to enhance the damage over time of their acid and it now reduces the damage the enemie deals."
LocPromotionPopupText="<Bullet/> Further upgrades acid bullet to enhance the damage over time of their acid and it now reduces the damage the enemie deals."

[RuptureBulletArtist X2AbilityTemplate]
LocFriendlyName="Rupture Bullet Artist"
LocHelpText="Further upgrades rupture bullet to strike twice for 60% damage each hit, and to deal massive cover damage to the cover of enemies hit."
LocLongDescription="Further upgrades rupture bullet to strike twice for 60% damage each hit, and to deal massive cover damage to the cover of enemies hit."
LocPromotionPopupText="<Bullet/> Further upgrades rupture bullet to strike twice for 60% damage each hit, and to deal massive cover damage to the cover of enemies hit."

[SwordBulletArtist X2AbilityTemplate]
LocFriendlyName="Sword Bullet Artist"
LocHelpText="Further upgrades sword bullet to strike twice for 60% damage each hit, deal bonus damage to enemies based on their psi, and to reduce the cooldowns of their other abilities."
LocLongDescription="Further upgrades sword bullet to strike twice for 60% damage each hit, deal bonus damage to enemies based on their psi, and to reduce the cooldowns of their other abilities."
LocPromotionPopupText="<Bullet/> Further upgrades sword bullet to strike twice for 60% damage each hit, deal bonus damage to enemies based on their psi, and to reduce the cooldowns of their other abilities."

[QuickBulletArtist X2AbilityTemplate]
LocFriendlyName="Quick Bullet Artist"
LocHelpText="Upgrades all bullet arts to grant a non-movement action after being used."
LocLongDescription="Upgrades all bullet arts to grant a non-movement action after being used."
LocPromotionPopupText="<Bullet/> Upgrades all bullet arts to grant a non-movement action after being used."

[TotalWarfare X2AbilityTemplate]
LocFriendlyName="Total Warfare"
LocHelpText="Grants the Watch Them Run and Salvo Perks."
LocLongDescription="Grants the Watch Them Run and Salvo Perks."
LocPromotionPopupText="<Bullet/> Watch Them Run will put you on overwatch when you launch or throw a grenade, Salvo makes throwing a grenade or using a heavy weapon non-turn ending."

[BlindingWarfare X2AbilityTemplate]
LocFriendlyName="Blinding Warfare"
LocHelpText="Grants the Flashy Plays and Salvo Perks."
LocLongDescription="Grants the Flashy Plays and Salvo Perks."
LocPromotionPopupText="<Bullet/> Flashy Plays makes it so you gain an additional charge for each equipped flashbang, Salvo makes throwing a grenade or using a heavy weapon non-turn ending."

[DefensiveWarfare X2AbilityTemplate]
LocFriendlyName="Defensive Warfare"
LocHelpText="Grants the Smoke and Mirrors and Salvo Perks."
LocLongDescription="Grants the Smoke and Mirrors and Salvo Perks."
LocPromotionPopupText="<Bullet/> Smoke and Mirrors makes it so you gain an additional charge for each equipped smoke grenade, Salvo makes throwing a grenade or using a heavy weapon non-turn ending."

[PRGrenadier X2AbilityTemplate]
LocFriendlyName="Grenadier"
LocHelpText="Grants this unit a grenade slot."
LocLongDescription="Grants this unit a grenade slot."
LocPromotionPopupText="<Bullet/> Grants this unit a grenade slot."

[BishopsWill X2AbilityTemplate]
LocFriendlyName="Bishops Will"
LocHelpText="Once per turn when this unit is attacked they will generate 1 focus. They will also generate focus on kills with Dragon Breath abilities or attacks with their shield."
LocLongDescription="Once per turn when this unit is attacked they will generate 1 focus. They will also generate focus on kills with Dragon Breath abilities or attacks with their shield."
LocPromotionPopupText="<Bullet/> Once per turn when this unit is attacked they will generate 1 focus. They will also generate focus on kills with Dragon Breath abilities or attacks with their shield."

[TacticalMovement X2AbilityTemplate]
LocFriendlyName="Tactical Movement"
LocHelpText="Grants the parkour and failsafe ability"
LocLongDescription="Grants the parkour and failsafe ability."
LocPromotionPopupText="<Bullet/> Parkour allows the soldier to climb walls so long as a window or other obstruction is not in the way, failsafe prevents the negatives from failed hacks."

[PerfectedGuard X2AbilityTemplate]
LocFriendlyName="Perfected Guard"
LocHelpText="The first Guard you use per turn will be a free action."
LocLongDescription="The first Guard you use per turn will be a free action."
LocPromotionPopupText="<Bullet/>The first Guard you use per turn will be a free action."

[NoQuarter X2AbilityTemplate]
LocFriendlyName="No Quarter"
LocHelpText="Charge an enemy and strike them with the butt of your weapon, then follow up with a pistol shot."
LocLongDescription="Charge an enemy and strike them with the butt of your weapon, then follow up with a pistol shot."
LocPromotionPopupText="<Bullet/> Charge an enemy and strike them with the butt of your weapon, then follow up with a pistol shot. \n<Bullet/> The Charge attack and Pistol attack scale with pistol damage, melee damage, and ammo. \n<Bullet/> The follow up pistol shot is considered a melee attack. \n<Bullet/> The charge attack and pistol shot are seperate attacks that individually roll to hit or crit."

[NoQuarter2 X2AbilityTemplate]
LocFriendlyName="No Quarter"
LocHelpText="No Quarter"
LocLongDescription="No Quarter"
LocPromotionPopupText="<Bullet/>No Quarter"

[CloseQuarterDuelist X2AbilityTemplate]
LocFriendlyName="Close Quarter Duelist "
LocHelpText="Take a shot with your pistol at an enemy that moves or attacks within 4 tiles of you. Only procs on aliens turn."
LocLongDescription="Take a shot with your pistol at an enemy that moves or attacks within 4 tiles of you. Only procs on aliens turn. "
LocPromotionPopupText="<Bullet/>Take a shot with your pistol at an enemy that moves or attacks within 4 tiles of you. Only procs on aliens turn. Once Per Target."

[ExplosiveRush X2AbilityTemplate]
LocFriendlyName="ExplosiveRush  "
LocHelpText="ExplosiveRush "
LocLongDescription="ExplosiveRush  "
LocPromotionPopupText="<Bullet/>ExplosiveRush "

[SurgicalSwiftness X2AbilityTemplate]
LocFriendlyName="SurgicalSwiftness "
LocHelpText="SurgicalSwiftness"
LocLongDescription="SurgicalSwiftness"
LocPromotionPopupText="<Bullet/>SurgicalSwiftness"


[Roustafarian X2AbilityTemplate]
LocFriendlyName="Roustafarian"
LocHelpText="Grants 2 additional charges of roust."
LocLongDescription="Grants 2 additional charges of roust."
LocPromotionPopupText="<Bullet/>Grants 2 additional charges of roust."

[JackOfAllTrades X2AbilityTemplate]
LocFriendlyName="Jack of All Trades"
LocHelpText="Grants additional abilities based off of equipped Primary Weapon"
LocLongDescription="Grants additional abilities based off of equipped Primary Weapon"
LocPromotionPopupText="<Bullet/>Grants additional abilities based off of equipped Primary Weapon. \n<Bullet/> Sniper: Squadsight, Shooting Sharp. Vektor Rifle: Squadsight, Lead The Target. \n<Bullet/> Shotgun: Trenchgun. SMG: Phantom. \n<Bullet/> Rifle: Sentinel. Cannon: Suppressing Fire. \n<Bullet/> Bullpup: Implacable. Chemthrower: Chemthrower Suppression."

[Wildcard X2AbilityTemplate]
LocFriendlyName="Wild Card"
LocHelpText="Grants additional abilities based off of equipped Secondary Weapon"
LocLongDescription="Grants additional abilities based off of equipped Secondary Weapon"
LocPromotionPopupText="<Bullet/>Grants additional abilities based off of equipped Secondary Weapon. \n<Bullet/> Gremlin: Hack, Haywire Protocol. Sawed-Off: Point Blank, Both Barrels. \n<Bullet/> Gauntlet: Heavy Arnaments, Roust. Arcthrower: Stun. \n<Bullet/> Pistol: High Noon, Quickdraw. Combat Knife: Knife Fighter, Lightning Knife. \n<Bullet/> Sword: Intercept, Fleche. Grenade Launcher: Improvise Explosive, Sapper. \n<Bullet/> Holotargeter: Holotarget, Multitargeting. Bit: Hack, Haywire Protocol. \n<Bullet/> Rocket: Blast Off, Rocket Launcher, Shield: Guard, Lightfoot."

[Highcard X2AbilityTemplate]
LocFriendlyName="High Card"
LocHelpText="Grants additional abilities based off of equipped Primary and Secondary Weapon"
LocLongDescription="Grants additional abilities based off of equipped Primary and Secondary Weapon."
LocPromotionPopupText="<Bullet/>Grants additional abilities based off of equipped Primary and Secondary Weapon. \n<Bullet/> Sniper: Executioneer. Vektor Rifle: This Ones Mine. \n<Bullet/> Shotgun: Predator. SMG: Stalker. \n<Bullet/> Rifle: Cool Under Pressure. Cannon: Covering Fire. \n<Bullet/> Bullpup: Marauder. Chemthrower: Nightmare Fuel. \n<Bullet/> Gremlin: Rescue Protocol. Sawed-Off: Pump Action. \n<Bullet/> Gauntlet: Fire In The Hole, Phosphorus. Arcthrower: Unlimited Power. \n<Bullet/> Pistol: Lightning Hands. Combat Knife: Combatives. \n<Bullet/> Sword: Shadowstep. Grenade Launcher: Fastball. \n<Bullet/> Holotargeter: Vital Point Targeting. Bit: Shellshock. \n<Bullet/> Rocket: Biggest Booms, Shield: Perfected Guard."

[Joker X2AbilityTemplate]
LocFriendlyName="Joker"
LocHelpText="Grants additional abilities based off of equipped Primary and Secondary Weapon"
LocLongDescription="Grants additional abilities based off of equipped Primary and Secondary Weapon"
LocPromotionPopupText="<Bullet/>Grants additional abilities based off of equipped Primary and Secondary Weapon. \n<Bullet/> Sniper: Lock N Load. Vektor Rifle: Watchful Eye (This Ones Mine). \n<Bullet/> Shotgun: Hunters Instinct. SMG: Conceal. \n<Bullet/> Rifle: Concentration. Cannon: Improved Suppression. \n<Bullet/> Bullpup: Center Mass. Chemthrower: Oppressive Heat. \n<Bullet/> Gremlin: Medical Protocol. Sawed-Off: Scrap Metal. \n<Bullet/> Gauntlet: Javeling Rockets, Incinerator. Arcthrower: Jolt Awake, Boost Move. \n<Bullet/> Pistol: Franctic Fire. Combat Knife: Bladestorm. \n<Bullet/> Sword: Covering Fire. Grenade Launcher: Combat Engineer. \n<Bullet/> Holotargeter: Rapid Targeting. Bit: Rocketeer. \n<Bullet/> Rocket: Fire In the Hole, Shield: Blurred."

[RoyalFlush X2AbilityTemplate]
LocFriendlyName="Royal Flush"
LocHelpText="Grants additional abilities based off of equipped Primary and Secondary Weapon"
LocLongDescription="Grants additional abilities based off of equipped Primary and Secondary Weapon"
LocPromotionPopupText="<Bullet/>Grants additional abilities based off of equipped Primary and Secondary Weapon. \n<Bullet/> Sniper: Burial Shot. Vektor Rifle: Stay On Target. \n<Bullet/> Shotgun: Run and Gun. SMG: Quick Feet. \n<Bullet/> Rifle: Opportunist. Cannon: Disabling Suppression. \n<Bullet/> Bullpup: Double Time. Chemthrower: Hotshot. \n<Bullet/> Gremlin: Shield Protocol. Sawed-Off: Whippit. \n<Bullet/> Gauntlet: Salvo, Quick Burn. Arcthrower: Quick Zap. \n<Bullet/> Pistol: I Meant to do That. Combat Knife: Reblossom. \n<Bullet/> Sword: Rout. Grenade Launcher: Devastation. \n<Bullet/> Holotargeter: Watchful Eye. Bit: Bombard. \n<Bullet/> Rocket: Salvo, Shield: Resilience"

[CallShot X2AbilityTemplate]
LocFriendlyName="Call Shot"
LocHelpText="Grants The Mark Target ability, and causes Mark Target to refund the actions used once per turn. Mark Target increase aim against a target for 2 turns with a 3 Turn Cooldown."
LocLongDescription="Grants The Mark Target ability, and causes Mark Target to refund the actions used once per turn. Mark Target increase aim against a target for 2 turns with a 3 Turn Cooldown."
LocPromotionPopupText="<Bullet/> Grants The Mark Target ability, and causes Mark Target to refund the actions used once per turn. Mark Target increase aim against a target for 2 turns with a 3 Turn Cooldown."

[DuckAndCover X2AbilityTemplate]
LocFriendlyName="Duck and Cover"
LocHelpText="Grants The Aim and Trench Warfare Perks. Aim increase your Aim and Crit by 20 after hunkering down, Trench Warfare will hunker you down at end of turn if you have killed an enemy."
LocLongDescription="Grants The Aim and Trench Warfare Perks. Aim increase your Aim and Crit by 20 after hunkering down, Trench Warfare will hunker you down at end of turn if you have killed an enemy."
LocPromotionPopupText="<Bullet/> Grants The Aim and Trench Warfare Perks. Aim increase your Aim and Crit by 20 after hunkering down, Trench Warfare will hunker you down at end of turn if you have killed an enemy."

[ToHellAndBack X2AbilityTemplate]
LocFriendlyName="To Hell and Back"
LocHelpText="Grants 3 Incendiary Grenades. These grenades are effected by the damage reduction of light ordinance, but you will get 3 Incendiary Grenades, not 9 from this perk."
LocLongDescription="Grants 3 Incendiary Grenades. These grenades are effected by the damage reduction of light ordinance, but you will get 3 Incendiary Grenades, not 9 from this perk."
LocPromotionPopupText="<Bullet/> Grants 3 Incendiary Grenades. These grenades are effected by the damage reduction of light ordinance, but you will get 3 Incendiary Grenades, not 9 from this perk."

[ToHellAndBack1 X2AbilityTemplate]
LocFriendlyName="To Hell and Back - First Grenade"
LocHelpText="To Hell and Back - First Grenade"
LocLongDescription="To Hell and Back - First Grenade"
LocPromotionPopupText="<Bullet/> To Hell and Back - First Grenade"

[ToHellAndBack2 X2AbilityTemplate]
LocFriendlyName="To Hell and Back - Second Grenade"
LocHelpText="To Hell and Back - Second Grenade"
LocLongDescription="To Hell and Back - Second Grenade"
LocPromotionPopupText="<Bullet/> To Hell and Back - Second Grenade"

[ToHellAndBack3 X2AbilityTemplate]
LocFriendlyName="To Hell and Back - Third Grenade"
LocHelpText="To Hell and Back - Third Grenade"
LocLongDescription="To Hell and Back - Third Grenade"
LocPromotionPopupText="<Bullet/> To Hell and Back - Third Grenade"

[GasGasGas X2AbilityTemplate]
LocFriendlyName="Gas Gas Gas"
LocHelpText="Grants 3 Gas Grenades. These grenades are effected by the damage reduction of light ordinance, but you will get 3 Gas Grenades, not 9 from this perk."
LocLongDescription="Grants 3 Gas Grenades. These grenades are effected by the damage reduction of light ordinance, but you will get 3 Gas Grenades, not 9 from this perk."
LocPromotionPopupText="<Bullet/> Grants 3 Gas Grenades. These grenades are effected by the damage reduction of light ordinance, but you will get 3 Gas Grenades, not 9 from this perk."

[gasgasgas1 X2AbilityTemplate]
LocFriendlyName="Gas Gas Gas - First Grenade"
LocHelpText="Gas Gas Gas - First Grenade"
LocLongDescription="Gas Gas Gas - First Grenade"
LocPromotionPopupText="<Bullet/> Gas Gas Gas - First Grenade"

[gasgasgas2 X2AbilityTemplate]
LocFriendlyName="Gas Gas Gas - Second Grenade"
LocHelpText="Gas Gas Gas - Second Grenade"
LocLongDescription="Gas Gas Gas - Second Grenade"
LocPromotionPopupText="<Bullet/> Gas Gas Gas - Second Grenade"

[gasgasgas3 X2AbilityTemplate]
LocFriendlyName="Gas Gas Gas - Third Grenade"
LocHelpText="Gas Gas Gas - Third Grenade"
LocLongDescription="Gas Gas Gas - Third Grenade"
LocPromotionPopupText="<Bullet/> Gas Gas Gas - Third Grenade"

[CausticArsenal X2AbilityTemplate]
LocFriendlyName="CausticArsenal"
LocHelpText="Grants 3 Acid Grenades. These grenades are effected by the damage reduction of light ordinance, but you will get 3 Acid Grenades, not 9 from this perk."
LocLongDescription="Grants 3 Acid Grenades. These grenades are effected by the damage reduction of light ordinance, but you will get 3 Acid Grenades, not 9 from this perk."
LocPromotionPopupText="<Bullet/> Grants 3 Acid Grenades. These grenades are effected by the damage reduction of light ordinance, but you will get 3 Acid Grenades, not 9 from this perk."

[CausticArsenal1 X2AbilityTemplate]
LocFriendlyName="CausticArsenal - First Grenade"
LocHelpText="CausticArsenal - First Grenade"
LocLongDescription="CausticArsenal - First Grenade"
LocPromotionPopupText="<Bullet/> CausticArsenal - First Grenade"

[CausticArsenal2 X2AbilityTemplate]
LocFriendlyName="CausticArsenal - Second Grenade"
LocHelpText="CausticArsenal - Second Grenade"
LocLongDescription="CausticArsenal - Second Grenade"
LocPromotionPopupText="<Bullet/> CausticArsenal - Second Grenade"

[CausticArsenal3 X2AbilityTemplate]
LocFriendlyName="CausticArsenal - Third Grenade"
LocHelpText="CausticArsenal - Third Grenade"
LocLongDescription="CausticArsenal - Third Grenade"
LocPromotionPopupText="<Bullet/> CausticArsenal - Third Grenade"

[FanTheHammer X2AbilityTemplate]
LocFriendlyName="Fan The Hammer"
LocHelpText="Fire your pistol up to three times at a target. 2 Turn Cooldown. Costs 3 Ammo. Requires 2 Actions."
LocLongDescription="Fire your pistol up to three times at a target. 2 Turn Cooldown. Costs 3 Ammo. Requires 2 Actions."
LocPromotionPopupText="<Bullet/> Fire your pistol up to three times at a target. 2 Turn Cooldown. Requires 2 Actions. \n<Bullet/> Costs 3 Ammo, but will only use ammo based of the times you shoot. \n<Bullet/> You will stop shooting if the target dies early. \n<Bullet/> Auto-Loader Recommended as Expanded mags don't seem to work on pistols. \n<Bullet/> Does not Work with Quick Draw and Will Not Refund actions with Liquidator."

[Sheriff X2AbilityTemplate]
LocFriendlyName="Sheriff"
LocHelpText="Grants the Watchful Eye (Holotargeter) and Cool Under Pressure abilities."
LocLongDescription="Grants the Watchful Eye (Holotargeter) and Cool Under Pressure abilities."
LocPromotionPopupText="<Bullet/> Grants the Watchful Eye (Holotargeter) and Cool Under Pressure abilities. Cool Under Pressure: +10 Aim on Reaction Shots, Reaction Shots can Crit. Watchful Eye: Take a shot at enemies you have holotargeted when they move or attack. Once per enemy per turn."

